# Cable Size Get Cable Size Ids Method

Source: https://www.revitapidocs.com/2026/fc2452ad-5d22-9b36-4842-f6c8d6364068.htm

---

| Cable Size Get Cable Size Ids Method |
| --- |

Gets all the Cable Size ids in the given document, sorted by name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IList<ElementId> GetCableSizeIds(
	Document document
)
```

```
Public Shared Function GetCableSizeIds (
	document As Document
) As IList(Of ElementId)
```

```
public:
static IList<ElementId^>^ GetCableSizeIds(
	Document^ document
)
```

```
static member GetCableSizeIds :
        document : Document -> IList<ElementId>
```

#### Parameters

document Document
:   The document.

#### Return Value

IList ElementId
All the Cable Size ids in this document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace